In [1]:
import pandas as pd
df=pd.read_csv('accidental-deaths-in-usa-monthly.csv')
df.head(10)

     Month  Accidental deaths in USA: monthly, 1973 ? 1978
0  1973-01                                            9007
1  1973-02                                            8106
2  1973-03                                            8928
3  1973-04                                            9137
4  1973-05                                           10017
5  1973-06                                           10826
6  1973-07                                           11317
7  1973-08                                           10744
8  1973-09                                            9713
9  1973-10                                            9938

In [13]:
# Phương thức print(df.shape) được sử dụng để hiển thị kích thước của DataFrame df. Kết quả sẽ trả về một tuple chứa số hàng và số cột của DataFrame.
print(df.shape)

(72, 2)

In [14]:
print(df.columns)
#

Index(['Month', 'Accidental deaths in USA: monthly, 1973 ? 1978'], dtype='object')

In [15]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72 entries, 0 to 71
Data columns (total 2 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   Month                                           72 non-null     object
 1   Accidental deaths in USA: monthly, 1973 ? 1978  72 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.3+ KB
None

In [17]:
df.describe()

       Accidental deaths in USA: monthly, 1973 ? 1978
count                                           72.00
mean                                          8787.74
std                                            958.34
min                                           6892.00
25%                                           8089.00
50%                                           8728.50
75%                                           9323.25
max                                          11317.00

In [18]:
df.describe(include=["object", "bool"])

          Month
count        72
unique       72
top     1973-01
freq          1

In [11]:
df.tail(1)

      Month  Accidental deaths in USA: monthly, 1973 ? 1978
71  1978-12                                            9240

In [12]:
pd.set_option("display.precision", 2)